<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"fa86d538c60a36ebebe783950edcb1a4388edf915f7180d34e99ab6f330617d1","plan_job_ref":"Job Create terraform plan #296 at https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/21805026949","plan_out_hash":"aab85210880fdd37883008e9748905a8daef0565bda0b0ea4da0b6ddc0a1df70","plan_hash":"9ea8a994c564242b40bebdfd9024bcad228e714ee7fb80092d569cb4bd0495d4","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan in __infrastructure__
With backend config: `resource_group_name=rg-ProjectCoordinator-Deploy-prd
storage_account_name=stprdtfprojectcoordinato
container_name=tfstate
`<details open><summary>With variables</summary>

```hcl
environment                = "prd"
key_vault_name             = "kv-ProjectCoordi-prd-zgm"
open_route_service_api_key = (sensitive value)
redirect_uris_number       = 40
```
</details>
<details>
<summary>Plan: 6 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

OpenTofu will perform the following actions:

  # module.application_registrations.azuread_application_api_access.client_api will be updated in-place
!~  resource "azuread_application_api_access" "client_api" {
        id             = "/applications/4cd5de8f-cbc0-4f71-a21d-0920a48a4371/apiAccess/56a60f8e-7980-4a67-840f-08702c769338"
!~      scope_ids      = [
-           "1a88bff7-7876-3508-b1bf-37baabba2cb4",
-           "6ae8af62-9bb0-b066-b0d7-93de50358560",
-           "b2311893-becf-d116-d55c-6e9d58a10fa2",
-           "d0e5198d-d25c-677d-c0cd-12946cd50241",
-           "e8b499a2-6685-5266-0f9b-67f92cf357fc",
        ] -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.application_registrations.azuread_application_permission_scope.api_access["Settings.Delete"] will be created
+   resource "azuread_application_permission_scope" "api_access" {
+       admin_consent_description  = "Allows to delete settings for any user if Project Coordinator."
+       admin_consent_display_name = "Delete Settings"
+       application_id             = "**************************************************"
+       id                         = (known after apply)
+       scope_id                   = (known after apply)
+       type                       = "User"
+       user_consent_description   = "Allows to delete settings for any user if Project Coordinator."
+       user_consent_display_name  = "Delete Settings"
+       value                      = "Settings.Delete"
    }

  # module.application_registrations.azuread_application_permission_scope.api_access["Settings.Read"] will be created
+   resource "azuread_application_permission_scope" "api_access" {
+       admin_consent_description  = "Allows to read settings for any user if Project Coordinator."
+       admin_consent_display_name = "Read Settings"
+       application_id             = "**************************************************"
+       id                         = (known after apply)
+       scope_id                   = (known after apply)
+       type                       = "User"
+       user_consent_description   = "Allows to read settings for any user if Project Coordinator."
+       user_consent_display_name  = "Read Settings"
+       value                      = "Settings.Read"
    }

  # module.application_registrations.azuread_application_permission_scope.api_access["Settings.Write"] will be created
+   resource "azuread_application_permission_scope" "api_access" {
+       admin_consent_description  = "Allows to write settings for any user if Project Coordinator."
+       admin_consent_display_name = "Write Settings"
+       application_id             = "**************************************************"
+       id                         = (known after apply)
+       scope_id                   = (known after apply)
+       type                       = "User"
+       user_consent_description   = "Allows to write settings for any user if Project Coordinator."
+       user_consent_display_name  = "Write Settings"
+       value                      = "Settings.Write"
    }

  # module.application_registrations.random_uuid.api_scope_id["Settings.Delete"] will be created
+   resource "random_uuid" "api_scope_id" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.application_registrations.random_uuid.api_scope_id["Settings.Read"] will be created
+   resource "random_uuid" "api_scope_id" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.application_registrations.random_uuid.api_scope_id["Settings.Write"] will be created
+   resource "random_uuid" "api_scope_id" {
+       id     = (known after apply)
+       result = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #296](https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/21805026949)